wyniki_50G/fio_results_ext4_nvme/block_size_4096/lab-sec-5/fio_database_article_test_output.txt
database_article_test: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=128
fio-3.36
Starting 1 process
database_article_test: Laying out IO file (1 file / 51200MiB)

database_article_test: (groupid=0, jobs=1): err= 0: pid=3928: Tue Apr 15 19:42:45 2025
  read: IOPS=8324, BW=65.0MiB/s (68.2MB/s)(11.4GiB/180028msec)
    slat (nsec): min=1878, max=185359k, avg=29245.87, stdev=937638.04
    clat (usec): min=364, max=1329.9k, avg=8544.46, stdev=23438.75
     lat (usec): min=370, max=1329.9k, avg=8573.70, stdev=23465.24
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    7], 95.00th=[   48],
     | 99.00th=[   80], 99.50th=[  144], 99.90th=[  215], 99.95th=[  405],
     | 99.99th=[  776]
   bw (  KiB/s): min=  336, max=95120, per=100.00%, avg=66673.19, stdev=23640.66, samples=359
   iops        : min=   42, max=11890, avg=8334.06, stdev=2955.12, samples=359
  write: IOPS=8313, BW=65.0MiB/s (68.1MB/s)(11.4GiB/180028msec); 0 zone resets
    slat (usec): min=2, max=697342, avg=31.57, stdev=1145.23
    clat (usec): min=61, max=1623.2k, avg=6776.31, stdev=26986.37
     lat (usec): min=72, max=1623.2k, avg=6807.88, stdev=27019.10
    clat percentiles (usec):
     |  1.00th=[   277],  5.00th=[   510], 10.00th=[   889], 20.00th=[  1516],
     | 30.00th=[  1811], 40.00th=[  2024], 50.00th=[  2212], 60.00th=[  2376],
     | 70.00th=[  2606], 80.00th=[  2966], 90.00th=[  3785], 95.00th=[ 46400],
     | 99.00th=[ 80217], 99.50th=[147850], 99.90th=[227541], 99.95th=[583009],
     | 99.99th=[910164]
   bw (  KiB/s): min=  400, max=94368, per=100.00%, avg=66590.82, stdev=23646.38, samples=359
   iops        : min=   50, max=11796, avg=8323.74, stdev=2955.85, samples=359
  lat (usec)   : 100=0.01%, 250=0.34%, 500=2.09%, 750=1.82%, 1000=1.37%
  lat (msec)   : 2=14.15%, 4=44.19%, 10=29.48%, 20=0.14%, 50=2.67%
  lat (msec)   : 100=2.97%, 250=0.69%, 500=0.03%, 750=0.03%, 1000=0.02%
  lat (msec)   : 2000=0.01%
  cpu          : usr=5.17%, sys=21.03%, ctx=423840, majf=0, minf=16
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=1498662,1496719,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=65.0MiB/s (68.2MB/s), 65.0MiB/s-65.0MiB/s (68.2MB/s-68.2MB/s), io=11.4GiB (12.3GB), run=180028-180028msec
  WRITE: bw=65.0MiB/s (68.1MB/s), 65.0MiB/s-65.0MiB/s (68.1MB/s-68.1MB/s), io=11.4GiB (12.3GB), run=180028-180028msec

Disk stats (read/write):
  nvme0n1: ios=1498527/1500490, sectors=23976432/24914064, merge=0/74, ticks=11650412/9035837, in_queue=20686440, util=81.02%